app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(permited_params)
    if @appointment.save
---
INSERT INTO "appointments" ("customer_id", "doctor_id", "pet", "send_remider", "reason", "visit_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)