app/controllers/customers_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."customer_id" IN (2, 9)
---
  def index
    @customers = Customer.includes(:appointments).all